zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_rcc.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_ll_rcc.c
  * @author  MCD Application Team
  * @version $VERSION$
  * @date    $DATE$
  * @brief   RCC LL module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
#if defined(USE_FULL_LL_DRIVER)

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_ll_rcc.h"
#ifdef  USE_FULL_ASSERT
#include "stm32_assert.h"
#else
#define assert_param(expr) ((void)0U)
#endif /* USE_FULL_ASSERT */

/** @addtogroup STM32MP2xx_LL_Driver
  * @{
  */

#if defined(RCC)


/** @addtogroup RCC_LL
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @addtogroup RCC_LL_Private_Macros
  * @{
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup RCC_LL_Exported_Functions
  * @{
  */

/** @addtogroup RCC_LL_EF_Init
  * @{
  */

/**
  * @brief  Reset the RCC clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *         - HSI  ON and used as system clock source
  *         - HSE, CSI, PLL1, PLL2, PLL3 and PLL4 OFF
  *         - AHBs and APBs bus pre-scalers set to 1.
  *         - MCO1 and MCO2 OFF
  *         - All interrupts disabled (except Wake-up from CSTOP Interrupt Enable)
  * @note   This function doesn't modify the configuration of the
  *         - Peripheral clocks
  *         - LSI, LSE and RTC clocks
  *         - HSECSS and LSECSS
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: RCC registers are de-initialized
  *          - ERROR: not applicable
  */
ErrorStatus LL_RCC_DeInit(void)
{
  uint32_t i;

  /* Set HSION bit */
  LL_RCC_HSI_Enable();

  /* Insure HSIRDY bit is set before writing default MSIRANGE value */
  while (LL_RCC_HSI_IsReady() == 0U)
  {}

  /* Reset MCO1 Configuration Register */
  CLEAR_REG(RCC->MCO1CFGR);

  /* Reset MCO2 Configuration Register */
  CLEAR_REG(RCC->MCO2CFGR);

  /* Reset xbar channels inputs */
  /* Reset FINDIVx, PREDIVx */
  for (i = 0U; i < 64U; i++)
  {
    RCC->XBARxCFGR[i] = LL_RCC_XBAR_CLKSRC_HSI | (1U << 6);
    WRITE_REG(RCC->FINDIVxCFGR[i], 0x00000040U | (1U << 6));
    CLEAR_REG(RCC->PREDIVxCFGR[i]);
  }

  /* Reset PLLs */
  CLEAR_REG(RCC->PLL4CFGR4);
  CLEAR_REG(RCC->PLL5CFGR4);
  CLEAR_REG(RCC->PLL6CFGR4);
  CLEAR_REG(RCC->PLL7CFGR4);
  CLEAR_REG(RCC->PLL8CFGR4);
  WRITE_REG(RCC->PLL4CFGR1, 0x10000001U);
  WRITE_REG(RCC->PLL5CFGR1, 0x10000001U);
  WRITE_REG(RCC->PLL6CFGR1, 0x10000001U);
  WRITE_REG(RCC->PLL7CFGR1, 0x10000001U);
  WRITE_REG(RCC->PLL8CFGR1, 0x10000001U);
  CLEAR_REG(RCC->PLL4CFGR2);
  CLEAR_REG(RCC->PLL5CFGR2);
  CLEAR_REG(RCC->PLL6CFGR2);
  CLEAR_REG(RCC->PLL7CFGR2);
  CLEAR_REG(RCC->PLL8CFGR2);
  WRITE_REG(RCC->PLL4CFGR3, 0x04000000U);
  WRITE_REG(RCC->PLL5CFGR3, 0x04000000U);
  WRITE_REG(RCC->PLL6CFGR3, 0x04000000U);
  WRITE_REG(RCC->PLL7CFGR3, 0x04000000U);
  WRITE_REG(RCC->PLL8CFGR3, 0x04000000U);
  CLEAR_REG(RCC->PLL4CFGR5);
  CLEAR_REG(RCC->PLL5CFGR5);
  CLEAR_REG(RCC->PLL6CFGR5);
  CLEAR_REG(RCC->PLL7CFGR5);
  CLEAR_REG(RCC->PLL8CFGR5);
  CLEAR_REG(RCC->PLL4CFGR6);
  CLEAR_REG(RCC->PLL5CFGR6);
  CLEAR_REG(RCC->PLL6CFGR6);
  CLEAR_REG(RCC->PLL7CFGR6);
  CLEAR_REG(RCC->PLL8CFGR6);
  CLEAR_REG(RCC->PLL4CFGR7);
  CLEAR_REG(RCC->PLL5CFGR7);
  CLEAR_REG(RCC->PLL6CFGR7);
  CLEAR_REG(RCC->PLL7CFGR7);
  CLEAR_REG(RCC->PLL8CFGR7);

  /* Reset GFG */
  CLEAR_REG(RCC->MUXSELCFGR);

  /* Reset APBDIVx */
  CLEAR_REG(RCC->APB1DIVR);
  CLEAR_REG(RCC->APB2DIVR);
  CLEAR_REG(RCC->APB3DIVR);
  CLEAR_REG(RCC->APB4DIVR);
  CLEAR_REG(RCC->APBDBGDIVR);

  /* Reset HSITRIM value */
  CLEAR_REG(RCC->HSICFGR);

  /* Reset MSITRIM value */
  CLEAR_REG(RCC->MSICFGR);

  /* Reset RCC oscillator states except HSI */
  WRITE_REG(RCC->OCENCLRR, 0x7E2U);

  /* Clear all RCC interrupt flags */
#if defined(CORE_CA35)
  CLEAR_REG(RCC->C1CIESETR);
#elif defined(CORE_CM33)
  CLEAR_REG(RCC->C2CIESETR);
#endif /* CORE_CA35 */

  /* Clear all RCC Reset Flags */
  CLEAR_REG(RCC->HWRSTSCLRR);

  return SUCCESS;
}

/**
  * @}
  */

/**
  * @brief  Return the frequencies of different on chip clocks;  MPUSS, AXISS,
  *         MCUSS, ACLK, MLHCLK, APB[5:1] AHB[6:1] and MCU buses clocks.
  * @note   Each time MPUSS, AXISS, MCUSS, ACLK, MLHCLK, APB[5:1] AHB[6:1] and/or
  *         MCU clock changes, this function must be called to update structure
  *         fields. Otherwise, any configuration based on this function will
  *         be incorrect.
  * @param  RCC_Clocks pointer to a @ref LL_RCC_ClocksTypeDef structure which
  *         will hold the clocks frequencies.
  * @retval None
  */
void LL_RCC_GetSystemClocksFreq(LL_RCC_ClocksTypeDef *RCC_Clocks)
{
  uint32_t lsmcudiv;
  uint32_t apb_div;

  /*!< AXIM clock frequency */
  RCC_Clocks->AXIM_Frequency = HSI_VALUE;

  /*!< MLAHB clock frequency */
  RCC_Clocks->MLAHB_Frequency = HSI_VALUE;

  /* Read LSMCUDIV */
  lsmcudiv = LL_RCC_Get_LSMCUDIVR() + 1U;

  /*!< AHB1 clock frequency */
  RCC_Clocks->AHB1_Frequency = HSI_VALUE / lsmcudiv;

  /*!< AHB2 clock frequency */
  RCC_Clocks->AHB2_Frequency = HSI_VALUE / lsmcudiv;

  /*!< AHB3 clock frequency */
  RCC_Clocks->AHB3_Frequency = HSI_VALUE / lsmcudiv;

  /*!< AHB4 clock frequency */
  RCC_Clocks->AHB4_Frequency = HSI_VALUE / lsmcudiv;

  /*!< AHB5 clock frequency */
  RCC_Clocks->AHB5_Frequency = HSI_VALUE / lsmcudiv;

  RCC_Clocks->AHB6_Frequency = HSI_VALUE / lsmcudiv;

  /*!< AHBSR clock frequency */
  RCC_Clocks->AHBSR_Frequency = HSI_VALUE / lsmcudiv;

  /*!< APB1 clock frequency */
  apb_div = LL_RCC_GetAPB1Prescaler();
  apb_div = ((uint32_t)(1UL << apb_div) * lsmcudiv);
  RCC_Clocks->APB1_Frequency = HSI_VALUE / apb_div;

  /*!< APB2 clock frequency */
  apb_div = LL_RCC_GetAPB2Prescaler();
  apb_div = ((uint32_t)(1UL << apb_div) * lsmcudiv);
  RCC_Clocks->APB2_Frequency = HSI_VALUE / apb_div;

  /*!< APB3 clock frequency */
  apb_div = LL_RCC_GetAPB3Prescaler();
  apb_div = ((uint32_t)(1UL << apb_div) * lsmcudiv);
  RCC_Clocks->APB3_Frequency = HSI_VALUE / apb_div;

  /*!< APB4 clock frequency */
  apb_div = LL_RCC_GetAPB4Prescaler();
  apb_div = ((uint32_t)(1UL << apb_div) * lsmcudiv);
  RCC_Clocks->APB4_Frequency = HSI_VALUE / apb_div;
#if defined(RCC_APB5DIVR_APB5DIV)
  /*!< APB5 clock frequency */
  apb_div = LL_RCC_GetAPB5Prescaler();
  apb_div = ((uint32_t)(1UL << apb_div) * lsmcudiv);
  RCC_Clocks->APB5_Frequency = HSI_VALUE / apb_div;
#endif /* RCC_APB5DIVR_APB5DIV */
  /*!< APBSR clock frequency */
  RCC_Clocks->APBSR_Frequency = (HSI_VALUE / lsmcudiv);

