zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_rcc.c
  /*!< APBDBG clock frequency */
  apb_div = LL_RCC_GetAPBDBGPrescaler();
  apb_div = ((uint32_t)(1UL << apb_div) * lsmcudiv);
  RCC_Clocks->APBDBG_Frequency = HSI_VALUE / apb_div;
}

/**
  * @brief  Return PLL2 clocks frequency
  * @param  PLL_Clocks pointer to a @ref LL_RCC_ClocksTypeDef structure which
  *         will hold the clocks frequencies.
  * @retval None
  */
void LL_RCC_GetPLL2ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks)
{
  uint32_t pllinputfreq;
  uint32_t pllsource;
  uint32_t frefdiv;
  uint32_t fbdiv;
  uint32_t postdiv1;
  uint32_t postdiv2;
  uint64_t pll_vco;
  uint64_t pll_output;

  pllsource = LL_RCC_PLL2_GetSource();

  switch (pllsource)
  {
    case LL_RCC_PLL2SOURCE_HSI:
      pllinputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL2SOURCE_HSE:
      pllinputfreq = HSE_VALUE;
      break;

    case LL_RCC_PLL2SOURCE_MSI:
      pllinputfreq = MSI_VALUE;
      break;

    default:
      pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
      break;
  }

  frefdiv = LL_RCC_PLL2_GetFREFDIV();
  fbdiv = LL_RCC_PLL2_GetFBDIV();
  postdiv1 = (RCC->PLL2CFGR6 & RCC_PLL2CFGR6_POSTDIV1_Msk) >> RCC_PLL2CFGR6_POSTDIV1_Pos;
  postdiv2 = (RCC->PLL2CFGR7 & RCC_PLL2CFGR7_POSTDIV2_Msk) >> RCC_PLL2CFGR7_POSTDIV2_Pos;
  uint32_t config = postdiv1 * postdiv2;
  if (frefdiv != 0U)
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv) / (uint64_t)frefdiv;
  }
  else
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv);
  }
  if (config != 0U)
  {
    pll_output = pll_vco / config;
  }
  else
  {
    pll_output = pll_vco;
  }

  PLL_Clocks->freq = (uint32_t)pll_output;
}
#if defined(RCC_PLL3CFGR1_PLLEN)
/**
  * @brief  Return PLL3 clocks frequency
  * @param  PLL_Clocks pointer to a @ref LL_RCC_ClocksTypeDef structure which
  *         will hold the clocks frequencies.
  * @retval None
  */
void LL_RCC_GetPLL3ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks)
{
  uint32_t pllinputfreq;
  uint32_t pllsource;
  uint32_t frefdiv;
  uint32_t fbdiv;
  uint32_t postdiv1;
  uint32_t postdiv2;
  uint64_t pll_vco;
  uint64_t pll_output;

  pllsource = LL_RCC_PLL3_GetSource();

  switch (pllsource)
  {
    case LL_RCC_PLL3SOURCE_HSI:
      pllinputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL3SOURCE_HSE:
      pllinputfreq = HSE_VALUE;
      break;

    case LL_RCC_PLL3SOURCE_MSI:
      pllinputfreq = MSI_VALUE;
      break;

    default:
      pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
      break;
  }

  frefdiv = LL_RCC_PLL3_GetFREFDIV();
  fbdiv = LL_RCC_PLL3_GetFBDIV();
  postdiv1 = (RCC->PLL3CFGR6 & RCC_PLL3CFGR6_POSTDIV1_Msk) >> RCC_PLL3CFGR6_POSTDIV1_Pos;
  postdiv2 = (RCC->PLL3CFGR7 & RCC_PLL3CFGR7_POSTDIV2_Msk) >> RCC_PLL3CFGR7_POSTDIV2_Pos;
  uint32_t config = postdiv1 * postdiv2;
  if (frefdiv != 0U)
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv) / (uint64_t)frefdiv;
  }
  else
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv);
  }
  if (config != 0U)
  {
    pll_output = pll_vco / config;
  }
  else
  {
    pll_output = pll_vco;
  }

  PLL_Clocks->freq = (uint32_t)pll_output;
}
#endif /* RCC_PLL3CFGR1_PLLEN */

/**
  * @brief  Return PLL4 clocks frequency
  * @param  PLL_Clocks pointer to a @ref LL_RCC_ClocksTypeDef structure which
  *         will hold the clocks frequencies.
  * @retval None
  */
void LL_RCC_GetPLL4ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks)
{
  uint32_t pllinputfreq;
  uint32_t pllsource;
  uint32_t frefdiv;
  uint32_t fbdiv;
  uint32_t postdiv1;
  uint32_t postdiv2;
  uint64_t pll_vco;
  uint64_t pll_output;

  pllsource = LL_RCC_PLL4_GetSource();

  switch (pllsource)
  {
    case LL_RCC_PLL4SOURCE_HSI:
      pllinputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL4SOURCE_HSE:
      pllinputfreq = HSE_VALUE;
      break;

    case LL_RCC_PLL4SOURCE_MSI:
      pllinputfreq = MSI_VALUE;
      break;
#if defined(LL_RCC_PLL4SOURCE_CKIN)
    case LL_RCC_PLL4SOURCE_CKIN:
      pllinputfreq = EXTERNAL_CLOCK_VALUE;
      break;
#endif /* LL_RCC_PLL4SOURCE_CKIN */
    default:
      pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
      break;
  }

  frefdiv = LL_RCC_PLL4_GetFREFDIV();
  fbdiv = LL_RCC_PLL4_GetFBDIV();
  postdiv1 = (RCC->PLL4CFGR6 & RCC_PLL4CFGR6_POSTDIV1_Msk) >> RCC_PLL4CFGR6_POSTDIV1_Pos;
  postdiv2 = (RCC->PLL4CFGR7 & RCC_PLL4CFGR7_POSTDIV2_Msk) >> RCC_PLL4CFGR7_POSTDIV2_Pos;
  uint32_t config = postdiv1 * postdiv2;
  if (frefdiv != 0U)
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv) / (uint64_t)frefdiv;
  }
  else
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv);
  }
  if (config != 0U)
  {
    pll_output = pll_vco / config;
  }
  else
  {
    pll_output = pll_vco;
  }

  PLL_Clocks->freq = (uint32_t)pll_output;
}

/**
  * @brief  Return PLL5 clocks frequency
  * @param  PLL_Clocks pointer to a @ref LL_RCC_ClocksTypeDef structure which
  *         will hold the clocks frequencies.
  * @retval None
  */
void LL_RCC_GetPLL5ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks)
{
  uint32_t pllinputfreq;
  uint32_t pllsource;
  uint32_t frefdiv;
  uint32_t fbdiv;
  uint32_t postdiv1;
  uint32_t postdiv2;
  uint64_t pll_vco;
  uint64_t pll_output;

  pllsource = LL_RCC_PLL5_GetSource();

  switch (pllsource)
  {
    case LL_RCC_PLL5SOURCE_HSI:
      pllinputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL5SOURCE_HSE:
      pllinputfreq = HSE_VALUE;
      break;

    case LL_RCC_PLL5SOURCE_MSI:
      pllinputfreq = MSI_VALUE;
      break;
#if defined(LL_RCC_PLL5SOURCE_CKIN)
    case LL_RCC_PLL5SOURCE_CKIN:
      pllinputfreq = EXTERNAL_CLOCK_VALUE;
      break;
#endif /* LL_RCC_PLL5SOURCE_CKIN */
    default:
      pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
      break;
  }

  frefdiv = LL_RCC_PLL5_GetFREFDIV();
  fbdiv = LL_RCC_PLL5_GetFBDIV();
  postdiv1 = (RCC->PLL5CFGR6 & RCC_PLL5CFGR6_POSTDIV1_Msk) >> RCC_PLL5CFGR6_POSTDIV1_Pos;
  postdiv2 = (RCC->PLL5CFGR7 & RCC_PLL5CFGR7_POSTDIV2_Msk) >> RCC_PLL5CFGR7_POSTDIV2_Pos;
  uint32_t config = postdiv1 * postdiv2;
  if (frefdiv != 0U)
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv) / (uint64_t)frefdiv;
  }
  else
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv);
  }
  if (config != 0U)
  {
    pll_output = pll_vco / config;
  }
  else
  {
    pll_output = pll_vco;
  }

  PLL_Clocks->freq = (uint32_t)pll_output;
}

/**
  * @brief  Return PLL6 clocks frequency
  * @param  PLL_Clocks pointer to a @ref LL_RCC_ClocksTypeDef structure which
  *         will hold the clocks frequencies.
  * @retval None
  */
void LL_RCC_GetPLL6ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks)
{
  uint32_t pllinputfreq;
  uint32_t pllsource;
  uint32_t frefdiv;
  uint32_t fbdiv;
  uint32_t postdiv1;
  uint32_t postdiv2;
  uint64_t pll_vco;
  uint64_t pll_output;

