zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_rcc.c
  pllsource = LL_RCC_PLL6_GetSource();

  switch (pllsource)
  {
    case LL_RCC_PLL6SOURCE_HSI:
      pllinputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL6SOURCE_HSE:
      pllinputfreq = HSE_VALUE;
      break;

    case LL_RCC_PLL6SOURCE_MSI:
      pllinputfreq = MSI_VALUE;
      break;
#if defined(LL_RCC_PLL6SOURCE_CKIN)
    case LL_RCC_PLL6SOURCE_CKIN:
      pllinputfreq = EXTERNAL_CLOCK_VALUE;
      break;
#endif /* LL_RCC_PLL6SOURCE_CKIN */
    default:
      pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
      break;
  }

  frefdiv = LL_RCC_PLL6_GetFREFDIV();
  fbdiv = LL_RCC_PLL6_GetFBDIV();
  postdiv1 = (RCC->PLL6CFGR6 & RCC_PLL6CFGR6_POSTDIV1_Msk) >> RCC_PLL6CFGR6_POSTDIV1_Pos;
  postdiv2 = (RCC->PLL6CFGR7 & RCC_PLL6CFGR7_POSTDIV2_Msk) >> RCC_PLL6CFGR7_POSTDIV2_Pos;
  uint32_t config = postdiv1 * postdiv2;
  if (frefdiv != 0U)
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv) / (uint64_t)frefdiv;
  }
  else
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv);
  }
  if (config != 0U)
  {
    pll_output = pll_vco / config;
  }
  else
  {
    pll_output = pll_vco;
  }

  PLL_Clocks->freq = (uint32_t)pll_output;
}

/**
  * @brief  Return PLL7 clocks frequency
  * @param  PLL_Clocks pointer to a @ref LL_RCC_ClocksTypeDef structure which
  *         will hold the clocks frequencies.
  * @retval None
  */
void LL_RCC_GetPLL7ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks)
{
  uint32_t pllinputfreq;
  uint32_t pllsource;
  uint32_t frefdiv;
  uint32_t fbdiv;
  uint32_t postdiv1;
  uint32_t postdiv2;
  uint64_t pll_vco;
  uint64_t pll_output;

  pllsource = LL_RCC_PLL7_GetSource();

  switch (pllsource)
  {
    case LL_RCC_PLL7SOURCE_HSI:
      pllinputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL7SOURCE_HSE:
      pllinputfreq = HSE_VALUE;
      break;

    case LL_RCC_PLL7SOURCE_MSI:
      pllinputfreq = MSI_VALUE;
      break;
#if defined(LL_RCC_PLL7SOURCE_CKIN)
    case LL_RCC_PLL7SOURCE_CKIN:
      pllinputfreq = EXTERNAL_CLOCK_VALUE;
      break;
#endif /* LL_RCC_PLL7SOURCE_CKIN */
    default:
      pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
      break;
  }

  frefdiv = LL_RCC_PLL7_GetFREFDIV();
  fbdiv = LL_RCC_PLL7_GetFBDIV();
  postdiv1 = (RCC->PLL7CFGR6 & RCC_PLL7CFGR6_POSTDIV1_Msk) >> RCC_PLL7CFGR6_POSTDIV1_Pos;
  postdiv2 = (RCC->PLL7CFGR7 & RCC_PLL7CFGR7_POSTDIV2_Msk) >> RCC_PLL7CFGR7_POSTDIV2_Pos;
  uint32_t config = postdiv1 * postdiv2;
  if (frefdiv != 0U)
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv) / (uint64_t)frefdiv;
  }
  else
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv);
  }
  if (config != 0U)
  {
    pll_output = pll_vco / config;
  }
  else
  {
    pll_output = pll_vco;
  }

  PLL_Clocks->freq = (uint32_t)pll_output;
}

/**
  * @brief  Return PLL8 clocks frequency
  * @param  PLL_Clocks pointer to a @ref LL_RCC_ClocksTypeDef structure which
  *         will hold the clocks frequencies.
  * @retval None
  */
void LL_RCC_GetPLL8ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks)
{
  uint32_t pllinputfreq;
  uint32_t pllsource;
  uint32_t frefdiv;
  uint32_t fbdiv;
  uint32_t postdiv1;
  uint32_t postdiv2;
  uint64_t pll_vco;
  uint64_t pll_output;

  pllsource = LL_RCC_PLL8_GetSource();

  switch (pllsource)
  {
    case LL_RCC_PLL8SOURCE_HSI:
      pllinputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL8SOURCE_HSE:
      pllinputfreq = HSE_VALUE;
      break;

    case LL_RCC_PLL8SOURCE_MSI:
      pllinputfreq = MSI_VALUE;
      break;
#if defined(LL_RCC_PLL8SOURCE_CKIN)
    case LL_RCC_PLL8SOURCE_CKIN:
      pllinputfreq = EXTERNAL_CLOCK_VALUE;
      break;
#endif /* LL_RCC_PLL8SOURCE_CKIN */
    default:
      pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
      break;
  }

  frefdiv = LL_RCC_PLL8_GetFREFDIV();
  fbdiv = LL_RCC_PLL8_GetFBDIV();
  postdiv1 = (RCC->PLL8CFGR6 & RCC_PLL8CFGR6_POSTDIV1_Msk) >> RCC_PLL8CFGR6_POSTDIV1_Pos;
  postdiv2 = (RCC->PLL8CFGR7 & RCC_PLL8CFGR7_POSTDIV2_Msk) >> RCC_PLL8CFGR7_POSTDIV2_Pos;
  uint32_t config = postdiv1 * postdiv2;
  if (frefdiv != 0U)
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv) / (uint64_t)frefdiv;
  }
  else
  {
    pll_vco = ((uint64_t)pllinputfreq * (uint64_t)fbdiv);
  }
  if (config != 0U)
  {
    pll_output = pll_vco / config;
  }
  else
  {
    pll_output = pll_vco;
  }

  PLL_Clocks->freq = (uint32_t)pll_output;
}

/**
  * @brief  Return I2Cx clock frequency
  * @param  I2CxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I2C12_I3C12_CLKSOURCE
  *         @arg @ref LL_RCC_I2C46_CLKSOURCE
  *         @arg @ref LL_RCC_I2C35_I3C3_CLKSOURCE
  *         @arg @ref LL_RCC_I2C7_CLKSOURCE
  * @retval I2C clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetI2CClockFreq(uint32_t I2CxSource)
{
  uint32_t i2c_frequency;
  LL_PLL_ClocksTypeDef PLL_Clocks;
  uint32_t i2c_source;
  uint32_t i2c_source_freq;
  uint32_t i2c_prediv;
  uint32_t i2c_findiv;

  /* Add assert */

  switch (I2CxSource)
  {
#if defined(LL_RCC_I2C12_I3C12_CLKSOURCE)
    case LL_RCC_I2C12_I3C12_CLKSOURCE:
      i2c_source = LL_RCC_GetI2C1_2_I3C1_2ClockSource();
      i2c_prediv = LL_RCC_GetI2C1_2_I3C1_2_PREDIV();
      i2c_findiv = LL_RCC_GetI2C1_2_I3C1_2_FINDIV();
      break;
#elif defined(LL_RCC_I2C12_CLKSOURCE)
    case LL_RCC_I2C12_CLKSOURCE:
      i2c_source = LL_RCC_GetI2C1_2ClockSource();
      i2c_prediv = LL_RCC_GetI2C1_2_PREDIV();
      i2c_findiv = LL_RCC_GetI2C1_2_FINDIV();
      break;
#endif /* LL_RCC_I2C12_I3C12_CLKSOURCE */
#if defined(LL_RCC_I2C46_CLKSOURCE)
    case LL_RCC_I2C46_CLKSOURCE:
      i2c_source = LL_RCC_GetI2C4_6ClockSource();
      i2c_prediv = LL_RCC_GetI2C4_6_PREDIV();
      i2c_findiv = LL_RCC_GetI2C4_6_FINDIV();
      break;

    case LL_RCC_I2C35_I3C3_CLKSOURCE:
      i2c_source = LL_RCC_GetI2C3_5_I3C3ClockSource();
      i2c_prediv = LL_RCC_GetI2C3_5_I3C3_PREDIV();
      i2c_findiv = LL_RCC_GetI2C3_5_I3C3_FINDIV();
      break;

    case LL_RCC_I2C7_CLKSOURCE:
      i2c_source = LL_RCC_GetI2C7ClockSource();
      i2c_prediv = LL_RCC_GetI2C7_PREDIV();
      i2c_findiv = LL_RCC_GetI2C7_FINDIV();
      break;
#endif /* LL_RCC_I2C46_CLKSOURCE */

#if defined(LL_RCC_I2C3_CLKSOURCE)
    case LL_RCC_I2C3_CLKSOURCE:
      i2c_source = LL_RCC_GetI2C3ClockSource();
      i2c_prediv = LL_RCC_GetI2C3_PREDIV();
      i2c_findiv = LL_RCC_GetI2C3_FINDIV();
      break;
#endif /* LL_RCC_I2C3_CLKSOURCE */

