zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_rcc.c
#if defined(LL_RCC_I3C4_CLKSOURCE)
    case LL_RCC_I3C4_CLKSOURCE:
      i2c_source = LL_RCC_GetI3C4ClockSource();
      i2c_prediv = LL_RCC_GetI3C4_PREDIV();
      i2c_findiv = LL_RCC_GetI3C4_FINDIV();
      break;

#endif /* LL_RCC_I3C4_CLKSOURCE */
    default:
      i2c_source = 0U;
      i2c_prediv = 0U;
      i2c_findiv = 0U;
      break;
  }

  switch (i2c_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      i2c_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      i2c_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      i2c_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      i2c_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      i2c_source_freq = LSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_SPDIF:
      i2c_source_freq = 0;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      i2c_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      i2c_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      i2c_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      i2c_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      i2c_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      i2c_source_freq = PLL_Clocks.freq;
      break;
    default:
      i2c_source_freq = 0U;
      break;
  }

  i2c_frequency = i2c_source_freq / ((i2c_prediv + 1U) * (i2c_findiv + 1U));

  return i2c_frequency;
}

/**
  * @brief  Return SAIx clock frequency
  * @param  SAIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SAI1_MDF1_CLKSOURCE
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE
  *         @arg @ref LL_RCC_SAI34_CLKSOURCE
  * @retval SAI clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetSAIClockFreq(uint32_t SAIxSource)
{
  uint32_t sai_frequency;
  LL_PLL_ClocksTypeDef PLL_Clocks;
  uint32_t sai_source;
  uint32_t sai_source_freq;
  uint32_t sai_prediv;
  uint32_t sai_findiv;

  /* Add assert */

  switch (SAIxSource)
  {
#if defined(LL_RCC_SAI1_MDF1_CLKSOURCE)
    case LL_RCC_SAI1_MDF1_CLKSOURCE:
      sai_source = LL_RCC_GetSAI1_MDF1ClockSource();
      sai_prediv = LL_RCC_GetSAI1_MDF1_PREDIV();
      sai_findiv = LL_RCC_GetSAI1_MDF1_FINDIV();
      break;
#elif defined(LL_RCC_SAI1_CLKSOURCE)
    case LL_RCC_SAI1_CLKSOURCE:
      sai_source = LL_RCC_GetSAI1ClockSource();
      sai_prediv = LL_RCC_GetSAI1_PREDIV();
      sai_findiv = LL_RCC_GetSAI1_FINDIV();
      break;
#endif /* LL_RCC_SAI1_MDF1_CLKSOURCE */
    case LL_RCC_SAI2_CLKSOURCE:
      sai_source = LL_RCC_GetSAI2ClockSource();
      sai_prediv = LL_RCC_GetSAI2_PREDIV();
      sai_findiv = LL_RCC_GetSAI2_FINDIV();
      break;
#if defined(LL_RCC_SAI34_CLKSOURCE)
    case LL_RCC_SAI34_CLKSOURCE:
      sai_source = LL_RCC_GetSAI3_4ClockSource();
      sai_prediv = LL_RCC_GetSAI3_4_PREDIV();
      sai_findiv = LL_RCC_GetSAI3_4_PREDIV();
      break;
#else
    case LL_RCC_SAI3_CLKSOURCE:
      sai_source = LL_RCC_GetSAI3ClockSource();
      sai_prediv = LL_RCC_GetSAI3_PREDIV();
      sai_findiv = LL_RCC_GetSAI3_PREDIV();
      break;

    case LL_RCC_SAI4_CLKSOURCE:
      sai_source = LL_RCC_GetSAI4ClockSource();
      sai_prediv = LL_RCC_GetSAI4_PREDIV();
      sai_findiv = LL_RCC_GetSAI4_PREDIV();
      break;
#endif /* LL_RCC_SAI34_CLKSOURCE */
    default:
      sai_source = 0U;
      sai_prediv = 0U;
      sai_findiv = 0U;
      break;
  }

  switch (sai_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      sai_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      sai_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      sai_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      sai_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      sai_source_freq = LSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_SPDIF:
      sai_source_freq = 0;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      sai_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      sai_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      sai_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      sai_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      sai_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      sai_source_freq = PLL_Clocks.freq;
      break;
    default:
      sai_source_freq = 0U;
      break;
  }

  sai_frequency = sai_source_freq / ((sai_prediv + 1U) * (sai_findiv + 1U));

  return sai_frequency;
}

/**
  * @brief  Return SPIx clock frequency
  * @param  SPIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE
  *         @arg @ref LL_RCC_SPI45_CLKSOURCE
  *         @arg @ref LL_RCC_SPI67_CLKSOURCE
  *         @arg @ref LL_RCC_SPI8_CLKSOURCE
  * @retval SPI clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetSPIClockFreq(uint32_t SPIxSource)
{
  uint32_t spi_frequency;
  LL_PLL_ClocksTypeDef PLL_Clocks;
  uint32_t spi_source;
  uint32_t spi_source_freq;
  uint32_t spi_prediv;
  uint32_t spi_findiv;

  /* Add assert */

  switch (SPIxSource)
  {
    case LL_RCC_SPI1_CLKSOURCE:
      spi_source = LL_RCC_GetSPI1ClockSource();
      spi_prediv = LL_RCC_GetSPI1_PREDIV();
      spi_findiv = LL_RCC_GetSPI1_FINDIV();
      break;
#if defined(LL_RCC_SPI23_CLKSOURCE)
    case LL_RCC_SPI23_CLKSOURCE:
      spi_source = LL_RCC_GetSPI2_3ClockSource();
      spi_prediv = LL_RCC_GetSPI2_3_PREDIV();
      spi_findiv = LL_RCC_GetSPI2_3_FINDIV();
      break;
#else
    case LL_RCC_SPI2_CLKSOURCE:
      spi_source = LL_RCC_GetSPI2ClockSource();
      spi_prediv = LL_RCC_GetSPI2_PREDIV();
      spi_findiv = LL_RCC_GetSPI2_FINDIV();
      break;
    case LL_RCC_SPI3_CLKSOURCE:
      spi_source = LL_RCC_GetSPI3ClockSource();
      spi_prediv = LL_RCC_GetSPI3_PREDIV();
      spi_findiv = LL_RCC_GetSPI3_FINDIV();
      break;
#endif /* LL_RCC_SPI23_CLKSOURCE */
    case LL_RCC_SPI45_CLKSOURCE:
      spi_source = LL_RCC_GetSPI4_5ClockSource();
      spi_prediv = LL_RCC_GetSPI4_5_PREDIV();
      spi_findiv = LL_RCC_GetSPI4_5_FINDIV();
      break;
#if defined(LL_RCC_SPI67_CLKSOURCE)
    case LL_RCC_SPI67_CLKSOURCE:
      spi_source = LL_RCC_GetSPI6_7ClockSource();
      spi_prediv = LL_RCC_GetSPI6_7_PREDIV();
      spi_findiv = LL_RCC_GetSPI6_7_FINDIV();
      break;
#elif defined(LL_RCC_SPI6_CLKSOURCE)
    case LL_RCC_SPI6_CLKSOURCE:
      spi_source = LL_RCC_GetSPI6ClockSource();
      spi_prediv = LL_RCC_GetSPI6_PREDIV();
      spi_findiv = LL_RCC_GetSPI6_FINDIV();
      break;
#endif /* LL_RCC_SPI67_CLKSOURCE */
#if defined(RCC_SPI8CFGR_SPI8EN)
    case LL_RCC_SPI8_CLKSOURCE:
      spi_source = LL_RCC_GetSPI8ClockSource();
      spi_prediv = LL_RCC_GetSPI8_PREDIV();
      spi_findiv = LL_RCC_GetSPI8_FINDIV();
      break;
#endif /* RCC_SPI8CFGR_SPI8EN */
    default:
      spi_source = 0U;
      spi_prediv = 0U;
      spi_findiv = 0U;
      break;
  }

  switch (spi_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      spi_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      spi_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      spi_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      spi_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      spi_source_freq = LSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_SPDIF:
      spi_source_freq = 0;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      spi_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      spi_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      spi_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      spi_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      spi_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      spi_source_freq = PLL_Clocks.freq;
      break;
    default:
      spi_source_freq = 0U;
      break;
  }

  spi_frequency = spi_source_freq / ((spi_prediv + 1U) * (spi_findiv + 1U));

