zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_rcc.c
  return spi_frequency;
}

/**
  * @brief  Return UARTx clock frequency
  * @param  UARTxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE
  *         @arg @ref LL_RCC_UART24_CLKSOURCE
  *         @arg @ref LL_RCC_USART35_CLKSOURCE
  *         @arg @ref LL_RCC_USART6_CLKSOURCE
  *         @arg @ref LL_RCC_UART78_CLKSOURCE
  *         @arg @ref LL_RCC_UART9_CLKSOURCE
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE
  * @retval UART clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetUARTClockFreq(uint32_t UARTxSource)
{
  uint32_t uart_frequency;
  uint32_t uart_source;
  uint32_t uart_prediv;
  uint32_t uart_findiv;
  uint32_t uart_source_freq;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Add assert */

  switch (UARTxSource)
  {
    case LL_RCC_USART1_CLKSOURCE:
      uart_source = LL_RCC_GetUSART1ClockSource();
      uart_prediv = LL_RCC_GetUSART1_PREDIV();
      uart_findiv = LL_RCC_GetUSART1_FINDIV();
      break;

    case LL_RCC_UART24_CLKSOURCE:
      uart_source = LL_RCC_GetUART2_4ClockSource();
      uart_prediv = LL_RCC_GetUART2_4_PREDIV();
      uart_findiv = LL_RCC_GetUART2_4_FINDIV();
      break;

    case LL_RCC_USART35_CLKSOURCE:
      uart_source = LL_RCC_GetUSART3_5ClockSource();
      uart_prediv = LL_RCC_GetUSART3_5_PREDIV();
      uart_findiv = LL_RCC_GetUSART3_5_FINDIV();
      break;

    case LL_RCC_USART6_CLKSOURCE:
      uart_source = LL_RCC_GetUSART6ClockSource();
      uart_prediv = LL_RCC_GetUSART6_PREDIV();
      uart_findiv = LL_RCC_GetUSART6_FINDIV();
      break;
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
    case LL_RCC_UART78_CLKSOURCE:
      uart_source = LL_RCC_GetUART7_8ClockSource();
      uart_prediv = LL_RCC_GetUART7_8_PREDIV();
      uart_findiv = LL_RCC_GetUART7_8_FINDIV();
      break;
#else
    case LL_RCC_UART7_CLKSOURCE:
      uart_source = LL_RCC_GetUART7ClockSource();
      uart_prediv = LL_RCC_GetUART7_PREDIV();
      uart_findiv = LL_RCC_GetUART7_FINDIV();
      break;
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */
#if defined(LL_RCC_UART9_CLKSOURCE)
    case LL_RCC_UART9_CLKSOURCE:
      uart_source = LL_RCC_GetUART9ClockSource();
      uart_prediv = LL_RCC_GetUART9_PREDIV();
      uart_findiv = LL_RCC_GetUART9_FINDIV();
      break;
#endif /* LL_RCC_UART9_CLKSOURCE */
    case LL_RCC_LPUART1_CLKSOURCE:
      uart_source = LL_RCC_XBAR_CLKSRC_MSI;
      uart_prediv = LL_RCC_GetLPUART1_PREDIV();
      uart_findiv = LL_RCC_GetLPUART1_FINDIV();
      break;
    default:
      uart_source = 0U;
      uart_prediv = 0U;
      uart_findiv = 0U;
      break;
  }

  switch (uart_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      uart_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      uart_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      uart_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      uart_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      uart_source_freq = LSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_SPDIF:
      uart_source_freq = 0;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      uart_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      uart_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      uart_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      uart_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      uart_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      uart_source_freq = PLL_Clocks.freq;
      break;
    default:
      uart_source_freq = 0U;
      break;
  }

  uart_frequency = uart_source_freq / ((uart_prediv + 1U) * (uart_findiv + 1U));

  return uart_frequency;
}

/**
  * @brief  Return SDMMCx clock frequency
  * @param  SDMMCxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE
  *         @arg @ref LL_RCC_SDMMC3_CLKSOURCE
  * @retval SDMMC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetSDMMCClockFreq(uint32_t SDMMCxSource)
{
  uint32_t sdmmc_frequency;
  uint32_t sdmmc_source;
  uint32_t sdmmc_prediv;
  uint32_t sdmmc_findiv;
  uint32_t sdmmc_source_freq;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Add assert */

  switch (SDMMCxSource)
  {
    case LL_RCC_SDMMC1_CLKSOURCE:
      sdmmc_source = LL_RCC_GetSDMMC1ClockSource();
      sdmmc_prediv = LL_RCC_GetSDMMC1_PREDIV();
      sdmmc_findiv = LL_RCC_GetSDMMC1_FINDIV();
      break;

    case LL_RCC_SDMMC2_CLKSOURCE:
      sdmmc_source = LL_RCC_GetSDMMC2ClockSource();
      sdmmc_prediv = LL_RCC_GetSDMMC2_PREDIV();
      sdmmc_findiv = LL_RCC_GetSDMMC2_FINDIV();
      break;

    case LL_RCC_SDMMC3_CLKSOURCE:
      sdmmc_source = LL_RCC_GetSDMMC3ClockSource();
      sdmmc_prediv = LL_RCC_GetSDMMC3_PREDIV();
      sdmmc_findiv = LL_RCC_GetSDMMC3_FINDIV();
      break;

    default:
      sdmmc_source = 0U;
      sdmmc_prediv = 0U;
      sdmmc_findiv = 0U;
      break;
  }

  switch (sdmmc_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      sdmmc_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      sdmmc_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      sdmmc_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      sdmmc_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      sdmmc_source_freq = LSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_SPDIF:
      sdmmc_source_freq = 0;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      sdmmc_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      sdmmc_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      sdmmc_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      sdmmc_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      sdmmc_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      sdmmc_source_freq = PLL_Clocks.freq;
      break;
    default:
      sdmmc_source_freq = 0U;
      break;
  }

  sdmmc_frequency = sdmmc_source_freq / ((sdmmc_prediv + 1U) * (sdmmc_findiv + 1U));

  return sdmmc_frequency;
}

/**
  * @brief  Return ETHx clock frequency
  * @param  ETHxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1_ETHSW_CLKSOURCE
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE
  *         @arg @ref LL_RCC_ETH1PTP_ETH2PTP_CLKSOURCE
  * @retval ETH clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetETHClockFreq(uint32_t ETHxSource)
{
  uint32_t eth_frequency;
  uint32_t eth_source;
  uint32_t eth_prediv;
  uint32_t eth_findiv;
  uint32_t eth_source_freq;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Add assert */

