zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_rcc.c
  switch (ETHxSource)
  {
#if defined(LL_RCC_ETH1_ETHSW_CLKSOURCE)
    case LL_RCC_ETH1_ETHSW_CLKSOURCE:
#elif defined(LL_RCC_ETH1_CLKSOURCE)
    case LL_RCC_ETH1_CLKSOURCE:
#endif /* LL_RCC_ETH1_ETHSW_CLKSOURCE */
      eth_source = LL_RCC_GetETH1ClockSource();
      eth_prediv = LL_RCC_GetETH1_PREDIV();
      eth_findiv = LL_RCC_GetETH1_FINDIV();
      break;

    case LL_RCC_ETH2_CLKSOURCE:
      eth_source = LL_RCC_GetETH2ClockSource();
      eth_prediv = LL_RCC_GetETH2_PREDIV();
      eth_findiv = LL_RCC_GetETH2_FINDIV();
      break;

    case LL_RCC_ETH1PTP_ETH2PTP_CLKSOURCE:
      eth_source = LL_RCC_GetETH1_2_PTPClockSource();
      eth_prediv = LL_RCC_GetETH1_2_PTP_PREDIV();
      eth_findiv = LL_RCC_GetETH1_2_PTP_FINDIV();
      break;

    default:
      eth_source = 0U;
      eth_prediv = 0U;
      eth_findiv = 0U;
      break;
  }

  switch (eth_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      eth_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      eth_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      eth_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      eth_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      eth_source_freq = LSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_SPDIF:
      eth_source_freq = 0;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      eth_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      eth_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      eth_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      eth_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      eth_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      eth_source_freq = PLL_Clocks.freq;
      break;
    default:
      eth_source_freq = 0U;
      break;
  }

  eth_frequency = eth_source_freq / ((eth_prediv + 1U) * (eth_findiv + 1U));

  return eth_frequency;
}

/**
  * @brief  Return OSPIx clock frequency
  * @param  OSPIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_OSPI1_CLKSOURCE
  *         @arg @ref LL_RCC_OSPI2_CLKSOURCE
  * @retval OSPI clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetOSPIClockFreq(uint32_t OSPIxSource)
{
  uint32_t ospi_frequency;
  uint32_t ospi_source;
  uint32_t ospi_prediv;
  uint32_t ospi_findiv;
  uint32_t ospi_source_freq;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Add assert */

  switch (OSPIxSource)
  {
    case LL_RCC_OSPI1_CLKSOURCE:
      ospi_source = LL_RCC_GetOSPI1ClockSource();
      ospi_prediv = LL_RCC_GetOSPI1_PREDIV();
      ospi_findiv = LL_RCC_GetOSPI1_FINDIV();
      break;
#if defined(LL_RCC_OSPI2_CLKSOURCE)
    case LL_RCC_OSPI2_CLKSOURCE:
      ospi_source = LL_RCC_GetOSPI2ClockSource();
      ospi_prediv = LL_RCC_GetOSPI2_PREDIV();
      ospi_findiv = LL_RCC_GetOSPI2_FINDIV();
      break;
#endif /* LL_RCC_OSPI2_CLKSOURCE */
    default:
      ospi_source = 0U;
      ospi_prediv = 0U;
      ospi_findiv = 0U;
      break;
  }

  switch (ospi_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      ospi_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      ospi_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      ospi_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      ospi_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      ospi_source_freq = LSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_SPDIF:
      ospi_source_freq = 0;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      ospi_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      ospi_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      ospi_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      ospi_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      ospi_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      ospi_source_freq = PLL_Clocks.freq;
      break;
    default:
      ospi_source_freq = 0U;
      break;
  }

  ospi_frequency = ospi_source_freq / ((ospi_prediv + 1U) * (ospi_findiv + 1U));

  return ospi_frequency;
}

/**
  * @brief  Return FMCx clock frequency
  * @param  FMCxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_FMC_CLKSOURCE
  * @retval FMC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetFMCClockFreq(uint32_t FMCxSource)
{
  uint32_t fmc_frequency;
  uint32_t fmc_source;
  uint32_t fmc_prediv;
  uint32_t fmc_findiv;
  uint32_t fmc_source_freq;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Add assert */

  switch (FMCxSource)
  {
    case LL_RCC_FMC_CLKSOURCE:
      fmc_source = LL_RCC_GetFMCClockSource();
      fmc_prediv = LL_RCC_GetFMC_PREDIV();
      fmc_findiv = LL_RCC_GetFMC_FINDIV();
      break;

    default:
      fmc_source = 0U;
      fmc_prediv = 0U;
      fmc_findiv = 0U;
      break;
  }

  switch (fmc_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      fmc_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      fmc_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      fmc_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      fmc_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      fmc_source_freq = LSE_VALUE;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      fmc_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      fmc_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      fmc_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      fmc_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      fmc_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      fmc_source_freq = PLL_Clocks.freq;
      break;
    default:
      fmc_source_freq = 0U;
      break;
  }

  fmc_frequency = fmc_source_freq / ((fmc_prediv + 1U) * (fmc_findiv + 1U));

