zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_rcc.c
  return fmc_frequency;
}

#if defined(FDCAN1)
/**
  * @brief  Return FDCANx clock frequency
  * @param  FDCANxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE
  * @retval FDCAN clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetFDCANClockFreq(uint32_t FDCANxSource)
{
  uint32_t fdcan_frequency;
  uint32_t fdcan_source;
  uint32_t fdcan_prediv;
  uint32_t fdcan_findiv;
  uint32_t fdcan_source_freq;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Add assert */

  switch (FDCANxSource)
  {
    case LL_RCC_FMC_CLKSOURCE:
      fdcan_source = LL_RCC_GetFDCANClockSource();
      fdcan_prediv = LL_RCC_GetFDCAN_PREDIV();
      fdcan_findiv = LL_RCC_GetFDCAN_FINDIV();
      break;

    default:
      fdcan_source = 0U;
      fdcan_prediv = 0U;
      fdcan_findiv = 0U;
      break;
  }

  switch (fdcan_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      fdcan_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      fdcan_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      fdcan_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      fdcan_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      fdcan_source_freq = LSE_VALUE;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      fdcan_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      fdcan_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      fdcan_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      fdcan_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      fdcan_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      fdcan_source_freq = PLL_Clocks.freq;
      break;
    default:
      fdcan_source_freq = 0U;
      break;
  }

  fdcan_frequency = fdcan_source_freq / ((fdcan_prediv + 1U) * (fdcan_findiv + 1U));

  return fdcan_frequency;
}
#endif /*FDCAN1*/

/**
  * @brief  Return SPDIFRXx clock frequency
  * @param  SPDIFRXxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE
  * @retval SPDIFRX clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetSPDIFRXClockFreq(uint32_t SPDIFRXxSource)
{
  uint32_t spdifrx_frequency;
  uint32_t spdifrx_source;
  uint32_t spdifrx_prediv;
  uint32_t spdifrx_findiv;
  uint32_t spdifrx_source_freq;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Add assert */

  switch (SPDIFRXxSource)
  {
    case LL_RCC_SPDIFRX_CLKSOURCE:
      spdifrx_source = LL_RCC_GetSPDIFRXClockSource();
      spdifrx_prediv = LL_RCC_GetSPDIFRX_PREDIV();
      spdifrx_findiv = LL_RCC_GetSPDIFRX_FINDIV();
      break;

    default:
      spdifrx_source = 0U;
      spdifrx_prediv = 0U;
      spdifrx_findiv = 0U;
      break;
  }

  switch (spdifrx_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      spdifrx_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      spdifrx_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      spdifrx_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      spdifrx_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      spdifrx_source_freq = LSE_VALUE;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      spdifrx_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      spdifrx_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      spdifrx_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      spdifrx_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      spdifrx_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      spdifrx_source_freq = PLL_Clocks.freq;
      break;
    default:
      spdifrx_source_freq = 0U;
      break;
  }

  spdifrx_frequency = spdifrx_source_freq / ((spdifrx_prediv + 1U) * (spdifrx_findiv + 1U));

  return spdifrx_frequency;
}

/**
  * @brief  Return USBPHYx clock frequency
  * @param  USBPHYxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USB2PHY1_CLKSOURCE
  *         @arg @ref LL_RCC_USB2PHY2_CLKSOURCE
  *         @arg @ref LL_RCC_USB3PCIEPHY_CLKSOURCE
  * @retval USBPHY clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetUSBPHYClockFreq(uint32_t USBPHYxSource)
{
  uint32_t usbphy_frequency;
  uint32_t usbphy_source;
  uint32_t usbphy_prediv;
  uint32_t usbphy_findiv;
  uint32_t usbphy_source_freq;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Add assert */

  switch (USBPHYxSource)
  {
    case LL_RCC_USB2PHY1_CLKSOURCE:
      usbphy_source = LL_RCC_GetUSB2PHY1ClockSource();
      usbphy_prediv = LL_RCC_GetUSB2PHY1_PREDIV();
      usbphy_findiv = LL_RCC_GetSPDIFRX_FINDIV();
      break;

    case LL_RCC_USB2PHY2_CLKSOURCE:
      usbphy_source = LL_RCC_GetUSB2PHY2ClockSource();
      usbphy_prediv = LL_RCC_GetUSB2PHY2_PREDIV();
      usbphy_findiv = LL_RCC_GetUSB2PHY2_FINDIV();
      break;
#if defined(LL_RCC_USB3PCIEPHY_CLKSOURCE)
    case LL_RCC_USB3PCIEPHY_CLKSOURCE:
      usbphy_source = LL_RCC_GetUSB3PCIEPHYClockSource();
      usbphy_prediv = LL_RCC_GetUSB3PCIEPHY_PREDIV();
      usbphy_findiv = LL_RCC_GetUSB3PCIEPHY_FINDIV();
      break;
#endif /* LL_RCC_USB3PCIEPHY_CLKSOURCE */
    default:
      usbphy_source = 0U;
      usbphy_prediv = 0U;
      usbphy_findiv = 0U;
      break;
  }

  switch (usbphy_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      usbphy_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      usbphy_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      usbphy_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      usbphy_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      usbphy_source_freq = LSE_VALUE;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      usbphy_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      usbphy_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      usbphy_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      usbphy_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      usbphy_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      usbphy_source_freq = PLL_Clocks.freq;
      break;
    default:
      usbphy_source_freq = 0U;
      break;
  }

  usbphy_frequency = usbphy_source_freq / ((usbphy_prediv + 1U) * (usbphy_findiv + 1U));

  return usbphy_frequency;
}


/**
  * @brief  Return STGENx clock frequency
  * @param  STGENxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE
  * @retval STGEN clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetSTGENClockFreq(uint32_t STGENxSource)
{
  uint32_t stgen_frequency;
  uint32_t stgen_source;
  uint32_t stgen_prediv;
  uint32_t stgen_findiv;
  uint32_t stgen_source_freq;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Add assert */

  switch (STGENxSource)
  {
    case LL_RCC_STGEN_CLKSOURCE:
      stgen_source = LL_RCC_GetSTGENClockSource();
      stgen_prediv = LL_RCC_GetSTGEN_PREDIV();
      stgen_findiv = LL_RCC_GetSTGEN_FINDIV();
      break;

    default:
      stgen_source = 0U;
      stgen_prediv = 0U;
      stgen_findiv = 0U;
      break;
  }

  switch (stgen_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      stgen_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      stgen_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      stgen_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      stgen_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      stgen_source_freq = LSE_VALUE;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      stgen_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      stgen_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      stgen_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      stgen_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      stgen_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      stgen_source_freq = PLL_Clocks.freq;
      break;
    default:
      stgen_source_freq = 0U;
      break;
  }

  stgen_frequency = stgen_source_freq / ((stgen_prediv + 1U) * (stgen_findiv + 1U));

  return stgen_frequency;
}

