zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_rcc.c
#if defined(DSI)
/**
  * @brief  Return DSIx clock frequency
  * @param  DSIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DSIBLANE_CLKSOURCE
  *         @arg @ref LL_RCC_DSIPHY_CLKSOURCE
  * @retval DSI clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetDSIClockFreq(uint32_t DSIxSource)
{
  uint32_t dsi_frequency;
  uint32_t dsi_source;
  uint32_t dsi_prediv;
  uint32_t dsi_findiv;
  uint32_t dsi_source_freq;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Add assert */

  switch (DSIxSource)
  {
    case LL_RCC_DSIBLANE_CLKSOURCE:
      dsi_source = LL_RCC_GetDSIBLANEClockSource();
      dsi_prediv = LL_RCC_GetDSIBLANE_PREDIV();
      dsi_findiv = LL_RCC_GetDSIBLANE_FINDIV();
      break;

    case LL_RCC_DSIPHY_CLKSOURCE:
      dsi_source = LL_RCC_GetDSIPHYClockSource();
      dsi_prediv = LL_RCC_GetDSIPHY_PREDIV();
      dsi_findiv = LL_RCC_GetDSIPHY_FINDIV();
      break;

    default:
      dsi_source = 0U;
      dsi_prediv = 0U;
      dsi_findiv = 0U;
      break;
  }

  switch (dsi_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      dsi_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      dsi_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      dsi_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      dsi_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      dsi_source_freq = LSE_VALUE;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      dsi_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      dsi_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      dsi_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      dsi_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      dsi_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      dsi_source_freq = PLL_Clocks.freq;
      break;
    default:
      dsi_source_freq = 0U;
      break;
  }

  dsi_frequency = dsi_source_freq / ((dsi_prediv + 1U) * (dsi_findiv + 1U));

  return dsi_frequency;
}
#endif /* DSI */

/**
  * @brief  Return ADCx clock frequency
  * @param  ADCxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADC12_CLKSOURCE
  *         @arg @ref LL_RCC_ADC3_CLKSOURCE
  * @retval ADC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetADCClockFreq(uint32_t ADCxSource)
{
  uint32_t adc_frequency;
  uint32_t adc_source;
  uint32_t adc_prediv;
  uint32_t adc_findiv;
  uint32_t adc_source_freq;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Add assert */

  switch (ADCxSource)
  {
#if defined(LL_RCC_ADC12_CLKSOURCE)
    case LL_RCC_ADC12_CLKSOURCE:
      adc_source = LL_RCC_GetADC12ClockSource();
      adc_prediv = LL_RCC_GetADC12_PREDIV();
      adc_findiv = LL_RCC_GetADC12_FINDIV();
      break;

    case LL_RCC_ADC3_CLKSOURCE:
      adc_source = LL_RCC_GetADC3ClockSource();
      adc_prediv = LL_RCC_GetADC3_PREDIV();
      adc_findiv = LL_RCC_GetADC3_FINDIV();
      break;
#elif defined(LL_RCC_ADC1_CLKSOURCE)
    case LL_RCC_ADC1_CLKSOURCE:
      adc_source = LL_RCC_GetADC1ClockSource();
      adc_prediv = LL_RCC_GetADC1_PREDIV();
      adc_findiv = LL_RCC_GetADC1_FINDIV();
      break;

    case LL_RCC_ADC2_CLKSOURCE:
      adc_source = LL_RCC_GetADC2ClockSource();
      adc_prediv = LL_RCC_GetADC2_PREDIV();
      adc_findiv = LL_RCC_GetADC2_FINDIV();
      break;
#endif /* LL_RCC_ADC1_CLKSOURCE */


    default:
      adc_source = 0U;
      adc_prediv = 0U;
      adc_findiv = 0U;
      break;
  }

  switch (adc_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      adc_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      adc_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      adc_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      adc_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      adc_source_freq = LSE_VALUE;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      adc_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      adc_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      adc_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      adc_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      adc_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      adc_source_freq = PLL_Clocks.freq;
      break;
    default:
      adc_source_freq = 0U;
      break;
  }

  adc_frequency = adc_source_freq / ((adc_prediv + 1U) * (adc_findiv + 1U));

  return adc_frequency;
}

/**
  * @brief  Return LPTIMx clock frequency
  * @param  LPTIMxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM12_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE
  * @retval LPTIM clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetLPTIMClockFreq(uint32_t LPTIMxSource)
{
  uint32_t lptim_frequency;
  uint32_t lptim_source;
  uint32_t lptim_prediv;
  uint32_t lptim_findiv;
  uint32_t lptim_source_freq;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Add assert */

