zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_rcc.c
  switch (LPTIMxSource)
  {
    case LL_RCC_LPTIM12_CLKSOURCE:
      lptim_source = LL_RCC_GetLPTIM1_2ClockSource();
      lptim_prediv = LL_RCC_GetLPTIM1_2_PREDIV();
      lptim_findiv = LL_RCC_GetLPTIM1_2_FINDIV();
      break;

    case LL_RCC_LPTIM3_CLKSOURCE:
      lptim_source = LL_RCC_GetLPTIM3ClockSource();
      lptim_prediv = LL_RCC_GetLPTIM3_PREDIV();
      lptim_findiv = LL_RCC_GetLPTIM3_FINDIV();
      break;
#if defined(LL_RCC_LPTIM45_CLKSOURCE)
    case LL_RCC_LPTIM45_CLKSOURCE:
      lptim_source = LL_RCC_GetLPTIM4_5ClockSource();
      lptim_prediv = LL_RCC_GetLPTIM4_5_PREDIV();
      lptim_findiv = LL_RCC_GetLPTIM4_5_FINDIV();
      break;
#elif defined(LL_RCC_LPTIM4_CLKSOURCE)
    case LL_RCC_LPTIM4_CLKSOURCE:
      lptim_source = LL_RCC_GetLPTIM4ClockSource();
      lptim_prediv = LL_RCC_GetLPTIM4_PREDIV();
      lptim_findiv = LL_RCC_GetLPTIM4_FINDIV();
      break;

    case LL_RCC_LPTIM5_CLKSOURCE:
      lptim_source = LL_RCC_GetLPTIM5ClockSource();
      lptim_prediv = LL_RCC_GetLPTIM5_PREDIV();
      lptim_findiv = LL_RCC_GetLPTIM5_FINDIV();
      break;
#endif /* LL_RCC_LPTIM45_CLKSOURCE */
    default:
      lptim_source = 0U;
      lptim_prediv = 0U;
      lptim_findiv = 0U;
      break;
  }

  switch (lptim_source)
  {
    case LL_RCC_XBAR_CLKSRC_HSI:
    case LL_RCC_XBAR_CLKSRC_HSIKER:
      lptim_source_freq = HSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_HSE:
    case LL_RCC_XBAR_CLKSRC_HSEKER:
      lptim_source_freq = HSE_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_MSI:
    case LL_RCC_XBAR_CLKSRC_MSIKER:
      lptim_source_freq = MSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSI:
      lptim_source_freq = LSI_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_LSE:
      lptim_source_freq = LSE_VALUE;
      break;
#if defined(LL_RCC_XBAR_CLKSRC_I2S)
    case LL_RCC_XBAR_CLKSRC_I2S:
#elif defined(LL_RCC_XBAR_CLKSRC_CK_IN)
    case LL_RCC_XBAR_CLKSRC_CK_IN :
#endif /* LL_RCC_XBAR_CLKSRC_I2S */
      lptim_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV:
      LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
      lptim_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV:
      LL_RCC_GetPLL5ClockFreq(&PLL_Clocks);
      lptim_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV:
      LL_RCC_GetPLL6ClockFreq(&PLL_Clocks);
      lptim_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV:
      LL_RCC_GetPLL7ClockFreq(&PLL_Clocks);
      lptim_source_freq = PLL_Clocks.freq;
      break;
    case LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV:
      LL_RCC_GetPLL8ClockFreq(&PLL_Clocks);
      lptim_source_freq = PLL_Clocks.freq;
      break;
    default:
      lptim_source_freq = 0U;
      break;
  }

  lptim_frequency = lptim_source_freq / ((lptim_prediv + 1U) * (lptim_findiv + 1U));

  return lptim_frequency;
}


/**
  * @brief  Return RTC clock frequency
  * @retval RTC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetRTCClockFreq(void)
{
  uint32_t rtc_source;
  uint32_t rtc_source_freq;
  uint32_t config;

  /* Add assert */
  rtc_source = LL_RCC_GetRTCClockSource();
  config = LL_RCC_GetRTC_HSEPrescaler();
  switch (rtc_source)
  {
    case LL_RCC_RTC_CLKSOURCE_HSE_DIV:
      (config != 0U) ? (rtc_source_freq = HSE_VALUE / config) : (rtc_source_freq = 0U);
      break;
    case LL_RCC_RTC_CLKSOURCE_LSI:
      rtc_source_freq = LSI_VALUE;
      break;
    case LL_RCC_RTC_CLKSOURCE_LSE:
      rtc_source_freq = LSE_VALUE;
      break;
    default:
      rtc_source_freq = 0U;
      break;
  }

  return rtc_source_freq;
}

/**
  * @}
  */

/**
  * @}
  */
#endif /* RCC */

/**
  * @}
  */

#endif /* USE_FULL_LL_DRIVER */
